Revit 2024 API
BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionError Property
 The solution is in the opposite direction of the connection direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SolutionIsOppositeToConnectionError { get; }
Visual Basic
Public Shared ReadOnly Property SolutionIsOppositeToConnectionError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SolutionIsOppositeToConnectionError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace